БИТУправление_медицинским_центром_демо/src/Documents/Событие/Событие.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Событие</name>
  <basedOn>Document.Заявка</basedOn>
  <basedOn>Document.Событие</basedOn>
  <basedOn>Document.ЛистОжидания</basedOn>
  <basedOn>Task.ЗадачиПользователя</basedOn>
  <basedOn>Document.ОбратнаяСвязь</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DefinedType.ОснованиеСобытия</types>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСобытия</name>
    <type>
      <types>EnumRef.ВидыСобытий</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПлан</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаФакт</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Цель</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗвонка</name>
    <type>
      <types>CatalogRef.ТипыЗвонков</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсходЗвонка</name>
    <type>
      <types>CatalogRef.ИсходыЗвонка</types>
    </type>
  </attributes>
  <attributes>
    <name>УспешностьЗвонка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗвонокНачат</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗвонокЗавершен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерТелефона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДлительностьЗвонка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СозданАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаписьРазговора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>удалитьВидЗвонка</name>
    <type>
      <types>EnumRef.фонВидыЗвонков</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановыйИсполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ФактическийИсполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>бит_НабранныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипРекламы</name>
    <comment>UTM_MEDIUM</comment>
    <type>
      <types>CatalogRef.ТипыРекламы</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникИнформации</name>
    <comment>UTM_SOURCE</comment>
    <type>
      <types>CatalogRef.ИсточникиИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>РекламнаяКомпания</name>
    <comment>UTM_CAMPAIGN</comment>
    <type>
      <types>CatalogRef.РекламныеКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>КлючевоеСловоРекламнойКомпании</name>
    <comment>UTM_TERM</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СодержаниеОбъявления</name>
    <comment>UTM_CONTENT</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Document>

БИТУправление_медицинским_центром_демо/src/Enums/ВидыСобытий/ВидыСобытий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыСобытий</name>
  <enumValues>
    <name>ВходящееПисьмо</name>
  </enumValues>
  <enumValues>
    <name>ИсходящееПисьмо</name>
  </enumValues>
  <enumValues>
    <name>ВходящийЗвонок</name>
  </enumValues>
  <enumValues>
    <name>ИсходящийЗвонок</name>
  </enumValues>
  <enumValues>
    <name>ЛичнаяВстреча</name>
  </enumValues>
</mdclass:Enum>

БИТУправление_медицинским_центром_демо/src/Documents/Событие/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(Знач ДанныеЗаполнения, СтандартнаяОбработка)

	Если Не ЗначениеЗаполнено(ДанныеЗаполнения) Тогда 
		Возврат;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура")
		И ДанныеЗаполнения.Количество() = 1
		И ДанныеЗаполнения.Свойство("Основание")
	Тогда
		ДанныеЗаполнения = ДанныеЗаполнения.Основание;
	КонецЕсли;
	
	Если Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(ДанныеЗаполнения)) Тогда 
		ИсключаемыеРеквизиты = "Дата, Номер";
		Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЛистОжидания") Тогда
			ОбщегоНазначенияКлиентСервер.КонкатенацияСтрок(ИсключаемыеРеквизиты, "ТипРекламы, ИсточникИнформации, РекламнаяКомпания, КлючевоеСловоРекламнойКомпании, СодержаниеОбъявления");
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения, , ИсключаемыеРеквизиты);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Клиенты") Тогда 
		Клиент = ДанныеЗаполнения;
	Иначе
		Попытка
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	ЭтотОбъект.ДатаФакт = Дата(1,1,1);
	ЭтотОбъект.ДлительностьЗвонка = 0;
	ЭтотОбъект.ИсходЗвонка = Неопределено;
	ЭтотОбъект.ЗвонокЗавершен = Ложь;
	ЭтотОбъект.ЗвонокНачат = Ложь;
	ЭтотОбъект.ЗаписьРазговора = "";
	
	// Если прошлое событие было создано на основании ЛО, это событие тоже
	Если ТипЗнч(ДанныеЗаполнения) <> Тип("Структура") Тогда
		ЛистОжидания = CRMСервер.НайтиЛистОжиданияСвязанныйСДокументом(ДанныеЗаполнения);
		Если ЛистОжидания <> Неопределено Тогда 	
			ДанныеЗаполнения = ЛистОжидания;
		КонецЕсли;
	КонецЕсли;
	
	ЭтотОбъект.Основание = ДанныеЗаполнения;
	
	пчВидыСобытий = Перечисления.ВидыСобытий;
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Событие") Тогда
		
		Если ДанныеЗаполнения.ВидСобытия = пчВидыСобытий.ВходящееПисьмо
			Или ДанныеЗаполнения.ВидСобытия = пчВидыСобытий.ИсходящееПисьмо
		Тогда
			ВидСобытия = пчВидыСобытий.ИсходящееПисьмо;
			
		ИначеЕсли ДанныеЗаполнения.ВидСобытия = пчВидыСобытий.ВходящийЗвонок
			Или ДанныеЗаполнения.ВидСобытия = пчВидыСобытий.ИсходящийЗвонок
		Тогда
			ВидСобытия = пчВидыСобытий.ИсходящийЗвонок;
		КонецЕсли;
			
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ОказаниеУслуг") Тогда
		
		ВидСобытия = пчВидыСобытий.ИсходящийЗвонок;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЛистОжидания") Тогда 
		
		ВидСобытия = Перечисления.ВидыСобытий.ИсходящийЗвонок;
		ТипЗвонка = Справочники.ТипыЗвонков.ЗаписьНаПрием;
		Клиент = Основание.Клиент;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ЗадачаСсылка.ЗадачиПользователя") Тогда
		
		ВидСобытия = Перечисления.ВидыСобытий.ИсходящийЗвонок;
		
		Если ЗначениеЗаполнено(Основание.КонтактноеЛицо) Тогда
			Клиент = Основание.КонтактноеЛицо;
		ИначеЕсли ТипЗнч(Основание.Объект) = Тип("СправочникСсылка.Клиенты") Тогда
			Клиент = Основание.Объект;
		КонецЕсли;
			
		Комментарий = Основание.Описание;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ОбратнаяСвязь") Тогда
		
		ВидСобытия = пчВидыСобытий.ИсходящийЗвонок;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Клиент) Тогда 
		НомерТелефона = КонтактнаяИнформацияСерверПереопределяемый.НайтиКонтактнуюИнформацию(Клиент);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	CRMСервер.ОбращениеПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	CRMСервер.ОбращениеПриЗаписи(ЭтотОбъект, Отказ);
	
КонецПроцедуры

#КонецОбласти
